#include <stdio.h>
//
// Created by pandong on 2023/2/17.
//

void aaa()
{
    int a[5] = {1,2,3,4,5};
    int (*p)[5];
    p = &a;
    printf("%p\n", a); //输出数组名，一般用数组的首元素地址来标识一个数组，则输出数组首元素地址
    printf("%p\n", p); //根据上面，p为数组a的地址，输出数组a的地址
    printf("%p\n", *p); //*p表示数组a本身，一般用数组的首元素地址来标识一个数组
    printf("%p\n", &a[0]); //a[0]的地址
    printf("%p\n", &a[1]); //a[1]的地址
    printf("%p\n", p[0]); //数组首元素的地址
    printf("%d\n", **p); // *p表示首元素地址，所以**p就表示首元素的值
    printf("%d\n", *p[0]); //根据优先级，p[0] 表示首元素地址，则*p[0]表示首元素本身，即首元素的值1
}